Documents/СписаниеТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СписаниеТовара</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/СписаниеТовара/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// 1. Инициализация движений
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	// 3. Контроль остатков
	// Выполняем только если включена соответствующая константа
	Если Константы.КонтролироватьОстаткиПриСписании.Получить() = Истина Тогда
		ВыполнитьКонтрольОстатков(Отказ);
	КонецЕсли;
	
	// Если контроля не было или он прошел успешно (Отказ = Ложь) — формируем движения
	Если Не Отказ Тогда
		
		Для Каждого ТекСтрока Из Товары Цикл
			
			Движение = Движения.ОстаткиТоваров.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Склад = Склад;
			Движение.Номенклатура = ТекСтрока.Номенклатура;
			Движение.Количество = ТекСтрока.Количество;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольОстатков(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыДокумента.Номенклатура КАК Номенклатура,
		|	ТоварыДокумента.Количество КАК Количество,
		|	ТоварыДокумента.ПредставлениеНоменклатуры КАК ПредставлениеНоменклатуры
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&ТЧ_Товары КАК ТоварыДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.ПредставлениеНоменклатуры КАК Товар,
		|	ВТ_Товары.Количество КАК Требуется,
		|	ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) КАК Остаток,
		|	ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) - ВТ_Товары.Количество КАК Дефицит
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(&МоментВремени, Склад = &Склад) КАК ОстаткиТоваровОстатки
		|		ПО ВТ_Товары.Номенклатура = ОстаткиТоваровОстатки.Номенклатура
		|
		|ГДЕ
		|	ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) < ВТ_Товары.Количество";
	
	// Подготовка данных
	ТЧ_Свернутая = Товары.Выгрузить();
	ТЧ_Свернутая.Свернуть("Номенклатура", "Количество");
	
	// ИСПРАВЛЕНИЕ: Явное указание типа данных для колонки (Строка, 150 символов)
	ТипСтрока = Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(150));
	ТЧ_Свернутая.Колонки.Добавить("ПредставлениеНоменклатуры", ТипСтрока);
	
	Для Каждого Стр Из ТЧ_Свернутая Цикл
		Стр.ПредставлениеНоменклатуры = Строка(Стр.Номенклатура);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТЧ_Товары", ТЧ_Свернутая);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Не хватает товара ""%1"" на складе ""%2"". Требуется: %3, В наличии: %4. Не хватает: %5",
				Выборка.Товар,
				Склад,
				Выборка.Требуется,
				Выборка.Остаток,
				-Выборка.Дефицит);
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			
		КонецЦикла;
		
		Отказ = Истина;
		
	КонецЕсли;

КонецПроцедуры
